In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
%matplotlib inline
plt.rc('figure',figsize=(10,6))
np.set_printoptions(precision=2,suppress=True)

In [7]:
df = pd.DataFrame({
    'klucz1':['a','b','a','b','a','a'],
    'klucz2':['jeden','jeden','dwa','dwa','jeden','trzy'],
    'dane1':np.random.randn(6),
    'dane2':np.random.randn(6)
})

df

,klucz1,klucz2,dane1,dane2
0,a,jeden,1.007189,-2.001637
1,b,jeden,-1.296221,-0.371843
2,a,dwa,0.274992,1.669025
3,b,dwa,0.228913,-0.438570
4,a,jeden,1.352917,-0.539741
5,a,trzy,0.886429,0.476985

In [8]:
grouped = df['dane1'].groupby(df['klucz1'])
grouped

In [9]:
grouped.mean()

In [10]:
means = df['dane1'].groupby([df['klucz1'],df['klucz2']]).mean()
means

In [11]:
means.unstack()

klucz2,dwa,jeden,trzy
klucz1,,,
a,0.274992,1.180053,0.886429
b,0.228913,-1.296221,NaN

In [12]:
woj = np.array(['mazowieckie','małopolskie','lubelskie','śląskie','pomorskie','lubuskie'])
lata = np.array([2018,2018,2020,2018,2020,2019])
df['dane1'].groupby([woj,lata]).mean()

In [14]:
df['dane1'].groupby([woj]).mean()

In [15]:
df['dane1'].groupby([lata]).mean()

In [16]:
#iteracje na grupach
for name,group in df.groupby("klucz1"):
    print(name)
    print(group)

a
  klucz1 klucz2     dane1     dane2
0      a  jeden  1.007189 -2.001637
2      a    dwa  0.274992  1.669025
4      a  jeden  1.352917 -0.539741
5      a   trzy  0.886429  0.476985
b
  klucz1 klucz2     dane1     dane2
1      b  jeden -1.296221 -0.371843
3      b    dwa  0.228913 -0.438570

In [17]:
for (k1,k2), group in df.groupby(['klucz1','klucz2']):
    print((k1,k2))
    print(group)

('a', 'dwa')
  klucz1 klucz2     dane1     dane2
2      a    dwa  0.274992  1.669025
('a', 'jeden')
  klucz1 klucz2     dane1     dane2
0      a  jeden  1.007189 -2.001637
4      a  jeden  1.352917 -0.539741
('a', 'trzy')
  klucz1 klucz2     dane1     dane2
5      a   trzy  0.886429  0.476985
('b', 'dwa')
  klucz1 klucz2     dane1    dane2
3      b    dwa  0.228913 -0.43857
('b', 'jeden')
  klucz1 klucz2     dane1     dane2
1      b  jeden -1.296221 -0.371843

In [18]:
pieces = dict(list(df.groupby('klucz1')))
pieces['b']

,klucz1,klucz2,dane1,dane2
1,b,jeden,-1.296221,-0.371843
3,b,dwa,0.228913,-0.438570

In [19]:
df.dtypes
grouped = df.groupby(df.dtypes,axis=1)

In [20]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      dane1     dane2
0  1.007189 -2.001637
1 -1.296221 -0.371843
2  0.274992  1.669025
3  0.228913 -0.438570
4  1.352917 -0.539741
5  0.886429  0.476985
object
  klucz1 klucz2
0      a  jeden
1      b  jeden
2      a    dwa
3      b    dwa
4      a  jeden
5      a   trzy

In [22]:
#grupowanie przy użyciu słowników i serii

people = pd.DataFrame(np.random.randn(5,5),
                      columns=['a','b','c','d','e'],
                      index=['Leon','Filip','Olga','Anna','Nadia'])

people

,a,b,c,d,e
Leon,-0.753887,0.331286,1.349742,0.069877,0.246674
Filip,-0.011862,1.004812,1.327195,-0.919262,-1.549106
Olga,0.022185,0.758363,-0.660524,0.862580,-0.010032
Anna,0.050009,0.670216,0.852965,-0.955869,-0.023493
Nadia,-2.304234,-0.652469,-1.218302,-1.332610,1.074623